//
//  S5_Basic.swift
//  Learning-Swift 4
//
//  Created by 徐伟达 on 2018/2/27.
//  Copyright © 2018年 徐伟达. All rights reserved.
//

import Foundation

//------------------------------------------------------------------
//                         テスト関数
//------------------------------------------------------------------
func S5BasicTest() {
	print("//-------------------------------------------")
	print("//                S5 プロトコル")
	print("//-------------------------------------------")
	//---------------------------------------------
	//                 プロトコル
	//---------------------------------------------
	struct MyTest5_1: SampleProtocol { // 采用上面协议的结构体
		var sampleString: String {
			return "sample protocol 5.1"
		}
	}
	let myTest5_1: MyTest5_1 = MyTest5_1()
	print(myTest5_1.sampleString)
	//---------------------------------------------
	//               プロトコルの宣言
	//---------------------------------------------
	
}

//------------------------------------------------------------------
//                    プロトコル　補助エリア
//------------------------------------------------------------------
protocol SampleProtocol {
	var sampleString: String { get }
//	static var sampleString2: String { get }
//	static func + (lhs: Self, rhs: Self) -> Int
}

//------------------------------------------------------------------
//                    ....　補助エリア
//------------------------------------------------------------------
