//
//  main.swift
//  Learning-Swift
//
//  Created by Weida Xu on 2017/8/4.
//  Copyright © 2017年 Weida Xu. All rights reserved.
//

import Foundation

//------------------------------------------------------------------------------
//                                  说明
//这是我复习swift时候为自己创建的模板项目
//主要是为了提高实际开发的效率
//把swift的所有部分都做一份自己的模板
//------------------------------------------------------------------------------


//-------------------------------------------------------
//                     文件的链接测试
//-------------------------------------------------------
var linkTest = LinkTest();
linkTest.putsA();
